w9d5/music-app/app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save!
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "hNY1mzVgjTaSGMeeC2lPQA"], ["id", 6]]