w9d5/music-app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name") VALUES ($1) RETURNING "id"  [["name", "The Beatles"]]
---
  def create
    @band = Band.new(band_params)

    if @band.save